
////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.РаботаВМоделиСервиса.ПолучениеВнешнихКомпонент".
// ОбщийМодуль.ПолучениеВнешнихКомпонентВМоделиСервисаПереопределяемый.
//
// Серверные переопределяемые процедуры загрузки внешних компонент:
//  - внешних компоненты используемых программой;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяются идентификаторы внешних компонент, которые используются в конфигурации.
// Указаные внешние компоненты будут загружены при обработке поставляемых данных.
//
// Параметры:
//  Идентификаторы - Массив - содержит идентификаторы внешних компоненты.
//
Процедура ПриОпределенииИспользуемыхВерсийВнешнихКомпонент(Идентификаторы) Экспорт
	
	// Компоненты, используемые для тестировния подсистемы СтандартныеПодсистемы.ВнешниеКомпоненты.
	Идентификаторы.Добавить("InputDevice");
	Идентификаторы.Добавить("Scanner");
	Идентификаторы.Добавить("CustomerDisplay1C");
	Идентификаторы.Добавить("RFIDReader");
	
КонецПроцедуры

#КонецОбласти
